In [1]:
import pandas as pd

In [2]:
pd.read_csv(r"C:\Users\Asus\Desktop\Book1.csv")

   batch name  caste   roll no  course
0      1   ron  gen          22  python
1      1   div  gen          45   java
2      3  yash  gen          33     C++
3      2  mona  gen          22  python
4      2  pona  gen          75   java

In [5]:
pd.read_csv(r"C:\Users\Asus\Desktop\data.tsv",sep="\t")

       name  batch  branch     software
rohan     1    cse     NaN       python
vipul     2  b.com     NaN        java
MOHIN     3    BYY     NaN  JAVA SCRIPT
MOHIT     4    bmm     NaN       python

In [6]:
import os

In [7]:
os.getcwd()

'C:\\Users\\Asus'

In [15]:
pd.read_excel

     name    batch  roll no  course
0   rohan   python         1     cse
1   aalam     java         2   java
2     vine    java         3    cse
3    gitu     java         4     cse
4  monika     java         5     cse
5   rajesh    java         6     cse

In [16]:
pd.read_excel('Book1.xlsx')

     name    batch  roll no  course
0   rohan   python         1     cse
1   aalam     java         2   java
2     vine    java         3    cse
3    gitu     java         4     cse
4  monika     java         5     cse
5   rajesh    java         6     cse